module parameter
  use iso_fortran_env, only: real64, real32, output_unit
  implicit none
  private

  integer, parameter, public :: BIAS_FULL(3, 62) = reshape([ &
 1, 0, 0, &
2, 0, 0, &
-2, 1, 0, &
-1, 1, 0, &
0, 1, 0, &
1, 1, 0, &
2, 1, 0, &
-2, 2, 0, &
-1, 2, 0, &
0, 2, 0, &
1, 2, 0, &
2, 2, 0, &
-2, -2, 1, &
-1, -2, 1, &
0, -2, 1, &
1, -2, 1, &
2, -2, 1, &
-2, -1, 1, &
-1, -1, 1, &
0, -1, 1, &
1, -1, 1, &
2, -1, 1, &
-2, 0, 1, &
-1, 0, 1, &
0, 0, 1, &
1, 0, 1, &
2, 0, 1, &
-2, 1, 1, &
-1, 1, 1, &
0, 1, 1, &
1, 1, 1, &
2, 1, 1, &
-2, 2, 1, &
-1, 2, 1, &
0, 2, 1, &
1, 2, 1, &
2, 2, 1, &
-2, -2, 2, &
-1, -2, 2, &
0, -2, 2, &
1, -2, 2, &
2, -2, 2, &
-2, -1, 2, &
-1, -1, 2, &
0, -1, 2, &
1, -1, 2, &
2, -1, 2, &
-2, 0, 2, &
-1, 0, 2, &
0, 0, 2, &
1, 0, 2, &
2, 0, 2, &
-2, 1, 2, &
-1, 1, 2, &
0, 1, 2, &
1, 1, 2, &
2, 1, 2, &
-2, 2, 2, &
-1, 2, 2, &
0, 2, 2, &
1, 2, 2, &
2, 2, 2 &
              ], [3, 62]) !< 中心cell的偏移量, 此处默认cell的边长为截断半径的一半
  integer, parameter, public :: WP = real64           !< 默认工作精度(working presion)为双精度
  integer, parameter, public :: STDOUT = output_unit  !< 标准通道的输出ID

end module parameter
